In [73]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [31]:
titles["title"].value_counts(ascending=False).head(10)

Hamlet                  18
Carmen                  16
Macbeth                 15
Maya                    12
The Outsider            12
The Three Musketeers    11
Temptation              11
Kismet                  11
Freedom                 11
Othello                 11
Name: title, dtype: int64

### Which three years in the 1930s saw the most films released?

In [32]:
titles1930 = titles[titles["year"].between(1930,1939)]

In [34]:
titles1930["year"].value_counts().sort_index(ascending=False).head(3)

1939    1078
1938    1129
1937    1196
Name: year, dtype: int64

### Count the number of films that have been released in each decade over the history of cinema.

In [37]:
decades_movies = titles.groupby((titles["year"]//10)*10).sum()

In [38]:
decades_movies

           year
year
1890       5691
1900      70554
1910   12480272
1920   16928047
1930   19535718
1940   16675972
1950   24847468
1960   34413870
1970   36947758
1980   40176645
1990   44329715
2000   77628046
2010  136907973
2020     424338

### Count the number of "Hamlet" films made in each decade.

In [76]:
# hamlets = titles[titles["title"].str.contains("Hamlet")]
# hamlets_sorted = hamlets.sort_values("year")
# # final = names.groupby(["Gender",(names.Year//10*10),"Name"]).sum()

# make copy of titles - done
# change years by removing last digit - done
# group by years

titles2 = titles.copy()

In [77]:
# titles2["year"] = titles2["year"].astype(str).str[:-1].astype(np.int64)
titles2.head()

                     title  year
0           The Rising Son   199
1  The Thousand Plane Raid   196
2         Crucea de piatra   199
3                  Country   200
4               Gaiking II   201

In [79]:
# titles2["year"] = titles2["year"] * 10
titles2.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1960
2         Crucea de piatra  1990
3                  Country  2000
4               Gaiking II  2010

In [93]:
titles2.groupby("year").count()

      title
year
1890      3
1900     37
1910   6512
1920   8797
1930  10097
1940   8576
1950  12711
1960  17515
1970  18714
1980  20243
1990  22225
2000  38713
2010  67977
2020    210

In [102]:
# OR...

In [112]:
titles3 = titles.copy()
titles3.head()

                     title  year  decade
0           The Rising Son  1990    1990
1  The Thousand Plane Raid  1969    1960
2         Crucea de piatra  1993    1990
3                  Country  2000    2000
4               Gaiking II  2011    2010

In [115]:
def changeyear(x):
    # change year to decade
    y = int(x/10) * 10
    return y
# titles["decade"] = titles["year"].apply(changeyear)

In [166]:
titles["decade"] = titles["year"].apply(lambda x : int(x/10)*10)
# titles[["title", "decade"]].groupby("decade").count()
titles['decade'].value_counts()

2010    67977
2000    38713
1990    22225
1980    20243
1970    18714
1960    17515
1950    12711
1930    10097
1920     8797
1940     8576
1910     6512
2020      210
1900       37
1890        3
Name: decade, dtype: int64

### Count the number of "Rustler" characters in each decade of the history of film.

In [116]:
cast2 = cast.copy()

In [123]:
# run this to change years to decades
cast2["decade"] = cast2["year"].apply(changeyear)

In [124]:
cast2.head()

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010

In [128]:
rustlers = cast2[cast2["character"]=="Rustler"]
rustlers[["character", "decade"]].groupby("decade").count()

        character
decade
1920            6
1930           84
1940           18
1950            8
1960            2
1970            9
1980            1
1990            4
2000            2

### Count the number of "Hamlet" characters in each decade.

In [129]:
hamlets = cast2[cast2["character"]=="Hamlet"]
hamlets[["character","decade"]].groupby("decade").count()

        character
decade
1910            6
1920            1
1930            6
1940            1
1950            3
1960            7
1970            8
1980            2
1990           11
2000           19
2010           28

### What are the 11 most common character names in movie history?

In [168]:
cast["character"].value_counts().head(11)

Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: character, dtype: int64

### Who are the 10 people most often credited as "Herself" in film history?

In [177]:
herself = cast[cast["character"].str.contains("Herself")]
herself["name"].value_counts().head(10)

Queen Elizabeth II    17
Jacqueline Kennedy    11
Margaret Thatcher     10
Joyce Brothers        10
Pat Nixon              8
Hillary Clinton        8
Mary Jo Pehl           7
Sumie Sakai            6
Princess Margaret      6
Brigitte Bardot        6
Name: name, dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [178]:
himself = cast[cast["character"].str.contains("Himself")]
himself["name"].value_counts().head(10)

Adolf Hitler             116
Richard Nixon             56
John F. Kennedy           46
Ronald Reagan             44
Winston Churchill         28
Benito Mussolini          28
George W. Bush            26
Franklin D. Roosevelt     25
Joseph Stalin             24
Martin Luther King        24
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [181]:
y1945 = cast[cast["year"]==1945]
y1945["name"].value_counts().head(5)

Emmett Vogan       39
Sam (II) Harris    32
Harold Miller      29
Bess Flowers       29
Frank O'Connor     27
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [182]:
y1985 = cast[cast["year"]==1985]
y1985["name"].value_counts().head(5)

Mammootty        22
Shakti Kapoor    21
Sukumari         20
Lou Scheimer     15
Aruna Irani      15
Name: name, dtype: int64

### How many roles "Mammootty" has played in each year of his career.

In [184]:
mammootty = cast[cast["name"].str.contains("Mammootty")]
mammootty["year"].value_counts()

1985    22
1983    18
1986    18
1984    16
1990    15
2009    12
1989    10
2008     9
1987     9
2010     9
2006     8
2004     8
2000     7
2012     7
2011     7
2007     7
1982     7
1988     7
2005     6
2014     6
2015     6
1991     6
1995     5
1993     5
2013     5
1994     5
2016     4
1998     4
1999     4
1996     3
2001     3
1992     3
2002     3
1981     3
2003     2
1997     2
1980     2
1971     1
2017     1
Name: year, dtype: int64

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [190]:
patron_in = cast[cast["character"].str.contains("Patron in")]
patron_in["character"].value_counts().head(10)

Patron in Frisky Rabbit         16
Patron in Chinese Restaurant     9
Patron in the Coffee House       9
Patron in Billiard Parlor        5
Patron in restaurant             4
Patron in Bar                    4
Patron in Restaurant             3
Patron in Club                   3
Patron in cabaret                3
Theatre Patron in Loge           2
Name: character, dtype: int64

### What are the 10 most frequent roles that start with the word "Science"?

In [191]:
science = cast[cast["character"].str.contains("Science")]
science["character"].value_counts().head(10)

Science Teacher                            60
The Science Fair Contestants & Families     9
Science Fair Student                        9
Science Student                             9
Science Fair Judge                          6
Science Reporter                            5
Science Promo Cadet                         5
Science Club Member                         5
Science Kid                                 5
Science                                     4
Name: character, dtype: int64

### Count number of n-values of the roles that Judi Dench has played over her career.

In [207]:
judidench = cast[cast["name"].str.contains("Judi")]
judidench["n"].value_counts().sum()

1388

### Count number of n-values of Cary Grant's roles through his career.

In [209]:
carygrant = cast[cast["name"]=="Cary Grant"]
carygrant["n"].value_counts().sum()

75

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [210]:
sidneypoitier = cast[cast["name"]=="Sidney Poitier"]
sidneypoitier["n"].value_counts().sum()

42

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [243]:
y1950 = cast[cast["year"]==1950]
y1950n1 = y1950[y1950["n"]==1]
y1950n1["type"].value_counts()

actor      626
actress    281
Name: type, dtype: int64

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [244]:
y1950n2 = y1950[y1950["n"]==2]
y1950n2["type"].value_counts()

actor      437
actress    415
Name: type, dtype: int64